[
  {
    "id": 1,
    "companyLogo": "https://i.ibb.co/nfgwDwB/ajax.png",
    "jobTitle": "Software Engineer",
    "companyName": "Ajax Corporation",
    "remoteOrOnsite": "Remote",
    "location": "San Francisco, CA",
    "fullTimeOrPartTime": "Full-time",
    "salary": "$120,000 - $140,000",
    "jobDescription": "Ajax Corporation is seeking a highly skilled and motivated software engineer to join our team. As a software engineer, you will be responsible for developing and maintaining software solutions that meet the needs of our business. You will work closely with cross-functional teams, including product managers, designers, and other developers, to design, develop, test, and deploy software applications. You will also be responsible for ensuring that software solutions are scalable, efficient, and maintainable.",
    "jobResponsibility": "Collaborate with cross-functional teams to design, develop and implement software solutions that meet business needs.Write high-quality, efficient, and maintainable code following best practices and coding standards.Perform testing and debugging of software to ensure software quality and reliability.Identify and address software-related issues and bugs in a timely manner.Keep up-to-date with emerging trends and technologies in software engineering and apply them to enhance existing software solutions.Contribute to the development of technical documentation such as design documents, user manuals, and system documentation.Participate in code reviews and provide constructive feedback to team members.Communicate technical concepts and solutions to non-technical stakeholders.",
    "educationalRequirements": "Bachelors degree in Computer Science or related field",
    "experiences": "5+ years of experience in software development",
    "phone": "555-123-4567",
    "email": "careers@ajaxcorp.com"
  },
  {
    "id": 2,
    "companyLogo": "https://i.ibb.co/gmXhy19/bing.png",
    "jobTitle": "Search Quality Analyst",
    "companyName": "Bing Inc.",
    "remoteOrOnsite": "Onsite",
    "location": "Redmond, WA",
    "fullTimeOrPartTime": "Full-time",
    "salary": "$90,000 - $110,000",
    "jobDescription": "Bing Corporation is seeking a highly skilled and motivated software engineer to join our team. As a software engineer, you will be responsible for designing, developing, and maintaining software solutions that meet the needs of our business. You will work closely with cross-functional teams, including product managers, designers, and other developers, to design, develop, test, and deploy software applications. You will also be responsible for ensuring that software solutions are scalable, efficient, and maintainable.",
    "jobResponsibility": "Collaborate with cross-functional teams to design, develop and maintain software solutions that meet business needs.Write clean, efficient, and maintainable code following best practices and coding standards.Perform testing and debugging of software to ensure software quality and reliability.Identify and address software-related issues and bugs in a timely manner.Keep up-to-date with emerging trends and technologies in software engineering and apply them to enhance existing software solutions.Contribute to the development of technical documentation such as design documents, user manuals, and system documentation.Participate in code reviews and provide constructive feedback to team members.Communicate technical concepts and solutions to non-technical stakeholders.",
    "educationalRequirements": "Bachelor degree in Computer Science or related field",
    "experiences": "2+ years of experience in search quality analysis",
    "phone": "555-234-5678",
    "email": "careers@bing.com"
  },
  {
    "id": 3,
    "companyLogo": "https://i.ibb.co/ydmZYgj/google.png",
    "jobTitle": "Product Manager",
    "companyName": "Google LLC",
    "remoteOrOnsite": "Onsite",
    "location": "Mountain View, CA",
    "fullTimeOrPartTime": "Full-time",
    "salary": "$140,000 - $160,000",
    "jobDescription": "Google is seeking a highly skilled and motivated software engineer to join our team. As a software engineer, you will be responsible for designing, developing, and maintaining software solutions that meet the needs of our business. You will work closely with cross-functional teams, including product managers, designers, and other developers, to design, develop, test, and deploy software applications. You will also be responsible for ensuring that software solutions are scalable, efficient, and maintainable.",
    "jobResponsibility": "Collaborate with cross-functional teams to design, develop, and maintain software solutions that meet business needs.Write high-quality, efficient, and maintainable code following best practices and coding standards.Perform testing and debugging of software to ensure software quality and reliability.Identify and address software-related issues and bugs in a timely manner.Keep up-to-date with emerging trends and technologies in software engineering and apply them to enhance existing software solutions.Contribute to the development of technical documentation such as design documents, user manuals, and system documentation.Participate in code reviews and provide constructive feedback to team members.Communicate technical concepts and solutions to non-technical stakeholders.",
    "educationalRequirements": "Bachelor degree in Computer Science or related field",
    "experiences": "5+ years of experience in product management",
    "phone": "555-345-6789",
    "email": "careers@google.com"
  },
  {
    "id": 4,
    "companyLogo": "https://i.ibb.co/j6Yw5Hv/microsoft.png",
    "jobTitle": "Cloud Solutions Architect",
    "companyName": "Microsoft Corporation",
    "remoteOrOnsite": "Remote",
    "location": "Seattle, WA",
    "fullTimeOrPartTime": "Full-time",
    "salary": "$150,000 - $170,000",
    "jobDescription": "Microsoft is seeking a highly skilled and motivated Cloud Solutions Architect to join our team. As a Cloud Solutions Architect, you will be responsible for designing and implementing cloud-based solutions that meet the needs of our customers. You will work closely with customers, partners, and internal teams to understand business needs and technical requirements, and develop architecture, design, and deployment plans for cloud-based solutions. You will also be responsible for implementing best practices and standards for cloud-based solutions, including security, scalability, and performance.",
    "jobResponsibility": "Design and implement cloud-based solutions that meet customer needs and business requirements.Collaborate with customers, partners, and internal teams to understand business needs and technical requirements.Develop and document architecture, design, and deployment plans for cloud-based solutions.Implement best practices and standards for cloud-based solutions, including security, scalability, and performance.Stay up-to-date with emerging trends and technologies in cloud computing and apply them to enhance existing solutions.Provide technical guidance and support to customers and partners during the sales and implementation process.Conduct technical workshops and training sessions for customers, partners, and internal teams.Identify and escalate technical issues to appropriate teams for resolution.",
    "educationalRequirements": "Bachelors degree in Computer Science or related field",
    "experiences": "8+ years of experience in cloud architecture",
    "phone": "555-345-6789",
    "email": "careers@google.com"
  },
  {
    "id": 5,
    "companyLogo": "https://i.ibb.co/KqFv1Pg/netflix.png",
    "jobTitle": "Software Engineer",
    "companyName": "Netflix, Inc.",
    "remoteOrOnsite": "Remote",
    "location": "Los Gatos, CA",
    "fullTimeOrPartTime": "Full-time",
    "salary": "$130,000 - $150,000",
    "jobDescription": "Netflix is seeking a highly skilled and motivated software engineer to join our team. As a software engineer, you will be responsible for developing, testing, and maintaining high-quality software systems and applications. You will collaborate with cross-functional teams, including product managers, designers, and other developers, to design and implement new features and functionality. You will also contribute to the development of software architecture and design patterns.",
    "jobResponsibility": "Develop, test, and maintain high-quality software systems and applications.Collaborate with cross-functional teams to design and implement new features and functionality.Contribute to the development of software architecture and design patterns.Write efficient, scalable, and maintainable code using best practices and coding standards.Participate in code reviews and provide constructive feedback to team members.Identify and address software-related issues and bugs in a timely manner.Keep up-to-date with emerging trends and technologies in software engineering and apply them to enhance existing software solutions.Work with stakeholders to understand business requirements and translate them into technical solutions.",
    "educationalRequirements": "Bachelors degree in Computer Science or related field",
    "experiences": "3+ years of experience in software development",
    "phone": "555-456-7890",
    "email": "careers@netflix.com"
  },
  {
    "id": 6,
    "companyLogo": "https://i.ibb.co/ykWC4kW/tesla.png",
    "jobTitle": "Hardware Engineer",
    "companyName": "Tesla, Inc.",
    "remoteOrOnsite": "Onsite",
    "location": "Palo Alto, CA",
    "fullTimeOrPartTime": "Full-time",
    "salary": "$120,000 - $140,000",
    "jobDescription": "Tesla is seeking a highly skilled and motivated hardware engineer to join our team. As a hardware engineer, you will be responsible for designing and developing hardware components for Tesla's products, including electric vehicles, energy storage systems, and solar products. You will collaborate with cross-functional teams to define hardware specifications and requirements, and conduct design reviews, simulations, and testing to ensure compliance with those specifications and requirements.",
    "jobResponsibility": "Design and develop hardware components for Tesla's products, including electric vehicles, energy storage systems, and solar products.Collaborate with cross-functional teams to define hardware specifications and requirements.Conduct design reviews, simulations, and testing to ensure compliance with specifications and requirements.Develop and maintain hardware documentation, including schematics, BOMs, and test procedures.Work with suppliers to ensure timely delivery of high-quality components.Troubleshoot and resolve hardware-related issues during development and production.Stay up-to-date with emerging trends and technologies in hardware engineering and apply them to enhance existing products.Provide technical guidance and support to cross-functional teams.",
    "educationalRequirements": "Bachelors degree in Electrical Engineering or related field",
    "experiences": "5+ years of experience in hardware engineering",
    "phone": "555-567-8901",
    "email": "careers@tesla.com"
  }
]